/*1452210 计算机1班 郑熙远*/
#include <iostream>

using namespace std;

int main()
{
    cout<<"输入当月利润";
    double a,b;
    cin>>a;
    if(a<=100000)
        b=0.1*a;
    else if(a>100000&&a<=200000)
        b=10000+(a-100000)*0.075;
    else if(a>200000&&a<=400000)
        b=10000+7500+(a-200000)*0.05;
    else if(a>400000&&a<=600000)
        b=10000+7500+10000+(a-400000)*0.03;
    else if(a>600000&&a<=1000000)
        b=10000+7500+10000+6000+(a-600000)*0.015;
    else
        b=10000+7500+10000+6000+6000+(a-1e6);
    cout<<"应发奖金"<<b<<endl;
    return 0;
}
