/*1452210 计算机1班 郑熙远*/
#include <iostream>


using namespace std;

int main()
{
    long double a,t,z;
    int b,c,d,e,f,g,h,i,j,k,l,m,n;
    cout<<"输入"<<endl;
    cin>>z;
    t=z+0.001;
    a=t/10;

    b=a/100000000;
    c=(a-100000000*b)/10000000;
    d=(a-100000000*b-10000000*c)/1000000;
    e=(a-100000000*b-10000000*c-1000000*d)/100000;
    f=(a-100000000*b-10000000*c-1000000*d-100000*e)/10000;
    g=(a-100000000*b-10000000*c-1000000*d-100000*e-10000*f)/1000;
    h=(a-100000000*b-10000000*c-1000000*d-100000*e-10000*f-1000*g)/100;
    i=(a-100000000*b-10000000*c-1000000*d-100000*e-10000*f-1000*g-100*h)/10;
    n=(a-100000000*b-10000000*c-1000000*d-100000*e-10000*f-1000*g-100*h-10*i)*100000;
    j=n/100000;
    k=(n-j*100000)/10000;
    l=(n-j*100000-k*10000)/1000;
    m=(n-j*100000-k*10000-l*1000)/100;
    cout <<"十亿位"<< b<<endl;
    cout<< "亿位"<<c<<endl;
    cout<<"千万位"<<d<<endl;
    cout<<"百万位"<<e<<endl;
    cout<<"十万位"<<f<<endl;
    cout<<"万位"<<g<<endl;
    cout<<"千位"<<h<<endl;
    cout<<"百位"<<i<<endl;
    cout<<"十位"<<j<<endl;
    cout<<"个位"<<k<<endl;
    cout<<"十分位"<<l<<endl;
    cout<<"百分位"<<m<< endl;

    return 0;
}
